app/Models/UserModel.php

INSERT INTO `tbl_users` (`name`, `email`, `password`) VALUES ('awzRE8V4Ga', 'lejwb@j0d0.com', '$2y$10$O5do4e2V7G4nrKcmGjgIm.ePQrURcDrGDNscHUuuYoW37xf/ExkJq')
---
    public function insert_data($post, $table)
    {
        $db = $this->db;
        $builder = $db->table($table);

        /* Prepare data */
        $pdata['created_at'] = date('Y-m-d H:i:s');
        $pdata = array(
            'name'     => $post['name'],
            'email'    => $post['email'],
            'password' => password_hash($post['password'], PASSWORD_DEFAULT)
        );

        /* Insert Data */
        $result = $builder->Insert($pdata);
        $id = $db->insertID();